redakker/esp8266-firmware-mqtt/webserver.cpp
#include <PubSubClient.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <LinkedList.h>
#include "eepromhandler.h"

// This is a WebServer implementation
// Including, web template

class WebServer {

    ESP8266WebServer* server;
    String content;
    EEPROMHandler* eepromhandler;
    LinkedList<String>* networks;
    String display = "station"; // station/ap
    char jsonChar[1000];

  public:
    WebServer(ESP8266WebServer& server, EEPROMHandler& eepromhandler) {
      this->server = &server;
      this->eepromhandler = &eepromhandler;
    }

    void setup(bool wifi_station_mode, LinkedList<String>& networks) {

      this->networks = &networks;
      Serial.print("WebServer started in ");
      if (wifi_station_mode) {
        Serial.println("station mode");
        String display = "station"; // default
      } else {
        Serial.println("AP mode");
        display = "ap";
      }

      createWebServer();
      server -> begin();
    }

    void loop() {
      server -> handleClient();
    }

  private:
    /*
      private methods comes here
      void privatefunc(){

      }
    */

    void createWebServer() {

      if (display == "station") {
        server->on("/", [ = ]() {
          // If there is parameter "updatesettings", save the data
          // otherwise  just read the data from EEPROM and send it with the content
          //?device=&room=&button=&btype=stateful&relay=&dht22=&led=&resist=&rtype=analog&interval=

          String action = server->arg("action") == NULL ? "" : server->arg("action");

          String device = server->arg("device") == NULL ? "" : server->arg("device");
          String room = server->arg("room") == NULL ? "" : server->arg("room");
          String button = server->arg("button") == NULL ? "" : server->arg("button");
          String btype = server->arg("btype") == NULL ? "" : server->arg("btype");
          String relay = server->arg("relay") == NULL ? "" : server->arg("relay");
          String dht22 = server->arg("dht22") == NULL ? "" : server->arg("dht22");
          String led = server->arg("led") == NULL ? "" : server->arg("led");
          String resistname = server->arg("resistname") == NULL ? "" : server->arg("resistname");
          String resist = server->arg("resist") == NULL ? "" : server->arg("resist");
          String rtype = server->arg("rtype") == NULL ? "" : server->arg("rtype");
          String interval = server->arg("interval") == NULL ? "" : server->arg("interval");
          String trigger = server->arg("trigger") == NULL ? "" : server->arg("trigger");
          String echo = server->arg("echo") == NULL ? "" : server->arg("echo");
          String ssid = server->arg("ssid") == NULL ? "" : server->arg("ssid");
          String wifipasswd = server->arg("wifipasswd") == NULL ? "" : server->arg("wifipasswd");
          String mqttbroker = server->arg("mqttbroker") == NULL ? "" : server->arg("mqttbroker");
          String mqttuser = server->arg("mqttuser") == NULL ? "" : server->arg("mqttuser");
          String mqttpw = server->arg("mqttpw") == NULL ? "" : server->arg("mqttpw");
          String sda = server->arg("sda") == NULL ? "" : server->arg("sda");
          String sdc = server->arg("sdc") == NULL ? "" : server->arg("sdc");
          String motion = server->arg("motion") == NULL ? "" : server->arg("motion");
          String ledpin = server->arg("ledpin") == NULL ? "" : server->arg("ledpin");
          String lednum = server->arg("lednum") == NULL ? "" : server->arg("lednum");
          String txpin = server->arg("txpin") == NULL ? "" : server->arg("txpin");
          String rxpin = server->arg("rxpin") == NULL ? "" : server->arg("rxpin");


          if (action == "updatesettings") {
            eepromhandler->load();

            eepromhandler-> updateProperty("device", device, false);
            eepromhandler-> updateProperty("room", room, false);
            eepromhandler-> updateProperty("button", button, false);
            eepromhandler-> updateProperty("btype", btype, false);
            eepromhandler-> updateProperty("relay", relay, false);
            eepromhandler-> updateProperty("dht22", dht22, false);
            eepromhandler-> updateProperty("led", led , false);
            eepromhandler-> updateProperty("resist", resist, false);
            eepromhandler-> updateProperty("rtype", rtype, false);
            eepromhandler-> updateProperty("interval", interval, false);
            eepromhandler-> updateProperty("resistname", resistname, false);
            eepromhandler-> updateProperty("trigger", trigger, false);
            eepromhandler-> updateProperty("echo", echo, false);
            eepromhandler-> updateProperty("ssid", ssid, false);
            eepromhandler-> updateProperty("wifipasswd", wifipasswd, false);
            eepromhandler-> updateProperty("mqttbroker", mqttbroker, false);
            eepromhandler-> updateProperty("mqttuser", mqttuser, false);
            eepromhandler-> updateProperty("mqttpw", mqttpw, false);
            eepromhandler-> updateProperty("sda", sda, false);
            eepromhandler-> updateProperty("sdc", sdc, false);
            eepromhandler-> updateProperty("motion", motion, false);
            eepromhandler-> updateProperty("ledpin", ledpin, false);
            eepromhandler-> updateProperty("lednum", lednum, false);
            eepromhandler-> updateProperty("txpin", txpin, false);
            eepromhandler-> updateProperty("rxpin", rxpin, false);                      

            eepromhandler->save();
          }

          eepromhandler->load();


          // Always send the same conent with an updated data in it
          content =  "<!DOCTYPE HTML><html>\r\n";
          content += " <head>\r\n";
          content += " <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\r\n";
          content += " <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />\r\n";
          content += " <link rel=\"stylesheet\" href=\"http://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\">\r\n";
          content += " </head>\r\n";
          content += " <body>\r\n";
          content += " <div class=\"container\">\r\n";

